Ran Plan for project: `prod` dir: `environments/prod` workspace: `default`

<details><summary>Show Output</summary>

```diff
05:31:37.892 INFO   The stack at . will be processed in the following order for command plan:
Group 1
- Module ./net
- Module ./null


05:31:38.012 INFO   [null] Downloading Terraform configurations from ../../modules/null_resource into ./null/.terragrunt-cache/QLoGvuy2tix8fB8rMags9tmiMy8/d1oe809qNTHiBeOBkt54SHt-miw
05:31:38.017 INFO   [net] Downloading Terraform configurations from ../../modules/vpc into ./net/.terragrunt-cache/4BkNCia55dYG8O55O3iG2r6DUFw/J9L90idEJHtl0vLyB25y2Vb2P3Y
05:31:38.084 INFO   [null] terraform: Initializing the backend...
05:31:38.086 INFO   [null] terraform: Initializing provider plugins...
05:31:38.088 INFO   [net] terraform: Initializing the backend...
05:31:38.088 INFO   [null] terraform: - Finding latest version of hashicorp/null...
05:31:38.092 INFO   [net] terraform: Initializing provider plugins...
05:31:38.096 INFO   [net] terraform: - Finding latest version of hashicorp/aws...
05:31:38.150 INFO   [null] terraform: - Finding latest version of hashicorp/aws...
05:31:38.178 INFO   [null] terraform: - Installing hashicorp/null v3.2.3...
05:31:38.222 INFO   [net] terraform: - Installing hashicorp/aws v5.88.0...
05:31:38.578 INFO   [null] terraform: - Installed hashicorp/null v3.2.3 (signed by HashiCorp)
05:31:38.737 INFO   [null] terraform: - Installing hashicorp/aws v5.88.0...
05:32:02.451 INFO   [net] terraform: - Installed hashicorp/aws v5.88.0 (signed by HashiCorp)
05:32:02.451 INFO   [net] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
05:32:02.451 INFO   [net] terraform: selections it made above. Include this file in your version control repository
05:32:02.451 INFO   [net] terraform: so that Terraform can guarantee to make the same selections by default when
05:32:02.451 INFO   [net] terraform: you run "terraform init" in the future.
05:32:02.471 INFO   [net] terraform: Terraform has been successfully initialized!
05:32:02.846 INFO   [null] terraform: - Installed hashicorp/aws v5.88.0 (signed by HashiCorp)
05:32:02.846 INFO   [null] terraform: Terraform has created a lock file .terraform.lock.hcl to record the provider
05:32:02.846 INFO   [null] terraform: selections it made above. Include this file in your version control repository
05:32:02.846 INFO   [null] terraform: so that Terraform can guarantee to make the same selections by default when
05:32:02.846 INFO   [null] terraform: you run "terraform init" in the future.
05:32:02.848 INFO   [null] terraform: Terraform has been successfully initialized!
05:32:19.738 STDOUT [null] terraform: Terraform used the selected providers to generate the following execution
05:32:19.780 STDOUT [null] terraform: plan. Resource actions are indicated with the following symbols:
05:32:19.780 STDOUT [null] terraform:   + create
05:32:19.780 STDOUT [null] terraform: Terraform will perform the following actions:
05:32:19.780 STDOUT [null] terraform:   # null_resource.example will be created
05:32:19.780 STDOUT [null] terraform:   + resource "null_resource" "example" {
05:32:19.780 STDOUT [null] terraform:       + id       = (known after apply)
05:32:19.780 STDOUT [null] terraform:       + triggers = {
05:32:19.780 STDOUT [null] terraform:           + "always_run" = (known after apply)
05:32:19.780 STDOUT [null] terraform:         }
05:32:19.780 STDOUT [null] terraform:     }
05:32:19.780 STDOUT [null] terraform: Plan: 1 to add, 0 to change, 0 to destroy.
05:32:19.780 STDOUT [null] terraform: 
05:32:21.705 STDOUT [net] terraform: Terraform used the selected providers to generate the following execution
05:32:21.705 STDOUT [net] terraform: plan. Resource actions are indicated with the following symbols:
05:32:21.705 STDOUT [net] terraform:   + create
05:32:21.706 STDOUT [net] terraform: Terraform will perform the following actions:
05:32:21.707 STDOUT [net] terraform:   # aws_internet_gateway.igw will be created
05:32:21.707 STDOUT [net] terraform:   + resource "aws_internet_gateway" "igw" {
05:32:21.707 STDOUT [net] terraform:       + arn      = (known after apply)
05:32:21.707 STDOUT [net] terraform:       + id       = (known after apply)
05:32:21.707 STDOUT [net] terraform:       + owner_id = (known after apply)
05:32:21.707 STDOUT [net] terraform:       + tags     = {
05:32:21.707 STDOUT [net] terraform:           + "Name" = "Internet Gateway"
05:32:21.707 STDOUT [net] terraform:         }
05:32:21.707 STDOUT [net] terraform:       + tags_all = {
05:32:21.707 STDOUT [net] terraform:           + "Name" = "Internet Gateway"
05:32:21.707 STDOUT [net] terraform:         }
05:32:21.707 STDOUT [net] terraform:       + vpc_id   = (known after apply)
05:32:21.707 STDOUT [net] terraform:     }
05:32:21.707 STDOUT [net] terraform:   # aws_route.public_internet_access will be created
05:32:21.707 STDOUT [net] terraform:   + resource "aws_route" "public_internet_access" {
05:32:21.707 STDOUT [net] terraform:       + destination_cidr_block = "0.0.0.0/0"
05:32:21.707 STDOUT [net] terraform:       + gateway_id             = (known after apply)
05:32:21.707 STDOUT [net] terraform:       + id                     = (known after apply)
05:32:21.707 STDOUT [net] terraform:       + instance_id            = (known after apply)
05:32:21.707 STDOUT [net] terraform:       + instance_owner_id      = (known after apply)
05:32:21.707 STDOUT [net] terraform:       + network_interface_id   = (known after apply)
05:32:21.707 STDOUT [net] terraform:       + origin                 = (known after apply)
05:32:21.707 STDOUT [net] terraform:       + route_table_id         = (known after apply)
05:32:21.707 STDOUT [net] terraform:       + state                  = (known after apply)
05:32:21.707 STDOUT [net] terraform:     }
05:32:21.707 STDOUT [net] terraform:   # aws_route_table.public will be created
05:32:21.707 STDOUT [net] terraform:   + resource "aws_route_table" "public" {
05:32:21.707 STDOUT [net] terraform:       + arn              = (known after apply)
05:32:21.707 STDOUT [net] terraform:       + id               = (known after apply)
05:32:21.708 STDOUT [net] terraform:       + owner_id         = (known after apply)
05:32:21.708 STDOUT [net] terraform:       + propagating_vgws = (known after apply)
05:32:21.708 STDOUT [net] terraform:       + route            = (known after apply)
05:32:21.708 STDOUT [net] terraform:       + tags             = {
05:32:21.708 STDOUT [net] terraform:           + "Name" = "Public Route Table"
05:32:21.708 STDOUT [net] terraform:         }
05:32:21.708 STDOUT [net] terraform:       + tags_all         = {
05:32:21.708 STDOUT [net] terraform:           + "Name" = "Public Route Table"
05:32:21.708 STDOUT [net] terraform:         }
05:32:21.708 STDOUT [net] terraform:       + vpc_id           = (known after apply)
05:32:21.708 STDOUT [net] terraform:     }
05:32:21.708 STDOUT [net] terraform:   # aws_route_table_association.public[0] will be created
05:32:21.708 STDOUT [net] terraform:   + resource "aws_route_table_association" "public" {
05:32:21.708 STDOUT [net] terraform:       + id             = (known after apply)
05:32:21.708 STDOUT [net] terraform:       + route_table_id = (known after apply)
05:32:21.708 STDOUT [net] terraform:       + subnet_id      = (known after apply)
05:32:21.708 STDOUT [net] terraform:     }
05:32:21.708 STDOUT [net] terraform:   # aws_route_table_association.public[1] will be created
05:32:21.708 STDOUT [net] terraform:   + resource "aws_route_table_association" "public" {
05:32:21.708 STDOUT [net] terraform:       + id             = (known after apply)
05:32:21.708 STDOUT [net] terraform:       + route_table_id = (known after apply)
05:32:21.708 STDOUT [net] terraform:       + subnet_id      = (known after apply)
05:32:21.708 STDOUT [net] terraform:     }
05:32:21.708 STDOUT [net] terraform:   # aws_subnet.private[0] will be created
05:32:21.708 STDOUT [net] terraform:   + resource "aws_subnet" "private" {
05:32:21.708 STDOUT [net] terraform:       + arn                                            = (known after apply)
05:32:21.708 STDOUT [net] terraform:       + assign_ipv6_address_on_creation                = false
05:32:21.708 STDOUT [net] terraform:       + availability_zone                              = "us-east-1a"
05:32:21.708 STDOUT [net] terraform:       + availability_zone_id                           = (known after apply)
05:32:21.708 STDOUT [net] terraform:       + cidr_block                                     = "10.1.3.0/24"
05:32:21.708 STDOUT [net] terraform:       + enable_dns64                                   = false
05:32:21.708 STDOUT [net] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
05:32:21.708 STDOUT [net] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
05:32:21.709 STDOUT [net] terraform:       + id                                             = (known after apply)
05:32:21.709 STDOUT [net] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
05:32:21.709 STDOUT [net] terraform:       + ipv6_native                                    = false
05:32:21.709 STDOUT [net] terraform:       + map_public_ip_on_launch                        = false
05:32:21.709 STDOUT [net] terraform:       + owner_id                                       = (known after apply)
05:32:21.709 STDOUT [net] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
05:32:21.709 STDOUT [net] terraform:       + tags                                           = {
05:32:21.709 STDOUT [net] terraform:           + "Name" = "Private Subnet 0"
05:32:21.709 STDOUT [net] terraform:         }
05:32:21.709 STDOUT [net] terraform:       + tags_all                                       = {
05:32:21.709 STDOUT [net] terraform:           + "Name" = "Private Subnet 0"
05:32:21.709 STDOUT [net] terraform:         }
05:32:21.709 STDOUT [net] terraform:       + vpc_id                                         = (known after apply)
05:32:21.709 STDOUT [net] terraform:     }
05:32:21.709 STDOUT [net] terraform:   # aws_subnet.private[1] will be created
05:32:21.709 STDOUT [net] terraform:   + resource "aws_subnet" "private" {
05:32:21.709 STDOUT [net] terraform:       + arn                                            = (known after apply)
05:32:21.709 STDOUT [net] terraform:       + assign_ipv6_address_on_creation                = false
05:32:21.709 STDOUT [net] terraform:       + availability_zone                              = "us-east-1b"
05:32:21.709 STDOUT [net] terraform:       + availability_zone_id                           = (known after apply)
05:32:21.709 STDOUT [net] terraform:       + cidr_block                                     = "10.1.4.0/24"
05:32:21.709 STDOUT [net] terraform:       + enable_dns64                                   = false
05:32:21.709 STDOUT [net] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
05:32:21.709 STDOUT [net] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
05:32:21.709 STDOUT [net] terraform:       + id                                             = (known after apply)
05:32:21.709 STDOUT [net] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
05:32:21.710 STDOUT [net] terraform:       + ipv6_native                                    = false
05:32:21.710 STDOUT [net] terraform:       + map_public_ip_on_launch                        = false
05:32:21.710 STDOUT [net] terraform:       + owner_id                                       = (known after apply)
05:32:21.710 STDOUT [net] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
05:32:21.715 STDOUT [net] terraform:       + tags                                           = {
05:32:21.715 STDOUT [net] terraform:           + "Name" = "Private Subnet 1"
05:32:21.716 STDOUT [net] terraform:         }
05:32:21.716 STDOUT [net] terraform:       + tags_all                                       = {
05:32:21.718 STDOUT [net] terraform:           + "Name" = "Private Subnet 1"
05:32:21.718 STDOUT [net] terraform:         }
05:32:21.718 STDOUT [net] terraform:       + vpc_id                                         = (known after apply)
05:32:21.718 STDOUT [net] terraform:     }
05:32:21.719 STDOUT [net] terraform:   # aws_subnet.public[0] will be created
05:32:21.719 STDOUT [net] terraform:   + resource "aws_subnet" "public" {
05:32:21.719 STDOUT [net] terraform:       + arn                                            = (known after apply)
05:32:21.719 STDOUT [net] terraform:       + assign_ipv6_address_on_creation                = false
05:32:21.719 STDOUT [net] terraform:       + availability_zone                              = "us-east-1a"
05:32:21.719 STDOUT [net] terraform:       + availability_zone_id                           = (known after apply)
05:32:21.719 STDOUT [net] terraform:       + cidr_block                                     = "10.1.1.0/24"
05:32:21.719 STDOUT [net] terraform:       + enable_dns64                                   = false
05:32:21.720 STDOUT [net] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
05:32:21.720 STDOUT [net] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
05:32:21.720 STDOUT [net] terraform:       + id                                             = (known after apply)
05:32:21.720 STDOUT [net] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
05:32:21.720 STDOUT [net] terraform:       + ipv6_native                                    = false
05:32:21.720 STDOUT [net] terraform:       + map_public_ip_on_launch                        = true
05:32:21.720 STDOUT [net] terraform:       + owner_id                                       = (known after apply)
05:32:21.721 STDOUT [net] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
05:32:21.721 STDOUT [net] terraform:       + tags                                           = {
05:32:21.721 STDOUT [net] terraform:           + "Name" = "Public Subnet 0"
05:32:21.721 STDOUT [net] terraform:         }
05:32:21.721 STDOUT [net] terraform:       + tags_all                                       = {
05:32:21.721 STDOUT [net] terraform:           + "Name" = "Public Subnet 0"
05:32:21.721 STDOUT [net] terraform:         }
05:32:21.721 STDOUT [net] terraform:       + vpc_id                                         = (known after apply)
05:32:21.721 STDOUT [net] terraform:     }
05:32:21.721 STDOUT [net] terraform:   # aws_subnet.public[1] will be created
05:32:21.722 STDOUT [net] terraform:   + resource "aws_subnet" "public" {
05:32:21.722 STDOUT [net] terraform:       + arn                                            = (known after apply)
05:32:21.722 STDOUT [net] terraform:       + assign_ipv6_address_on_creation                = false
05:32:21.722 STDOUT [net] terraform:       + availability_zone                              = "us-east-1b"
05:32:21.722 STDOUT [net] terraform:       + availability_zone_id                           = (known after apply)
05:32:21.722 STDOUT [net] terraform:       + cidr_block                                     = "10.1.2.0/24"
05:32:21.723 STDOUT [net] terraform:       + enable_dns64                                   = false
05:32:21.723 STDOUT [net] terraform:       + enable_resource_name_dns_a_record_on_launch    = false
05:32:21.723 STDOUT [net] terraform:       + enable_resource_name_dns_aaaa_record_on_launch = false
05:32:21.723 STDOUT [net] terraform:       + id                                             = (known after apply)
05:32:21.723 STDOUT [net] terraform:       + ipv6_cidr_block_association_id                 = (known after apply)
05:32:21.723 STDOUT [net] terraform:       + ipv6_native                                    = false
05:32:21.723 STDOUT [net] terraform:       + map_public_ip_on_launch                        = true
05:32:21.724 STDOUT [net] terraform:       + owner_id                                       = (known after apply)
05:32:21.724 STDOUT [net] terraform:       + private_dns_hostname_type_on_launch            = (known after apply)
05:32:21.724 STDOUT [net] terraform:       + tags                                           = {
05:32:21.724 STDOUT [net] terraform:           + "Name" = "Public Subnet 1"
05:32:21.724 STDOUT [net] terraform:         }
05:32:21.724 STDOUT [net] terraform:       + tags_all                                       = {
05:32:21.724 STDOUT [net] terraform:           + "Name" = "Public Subnet 1"
05:32:21.724 STDOUT [net] terraform:         }
05:32:21.724 STDOUT [net] terraform:       + vpc_id                                         = (known after apply)
05:32:21.724 STDOUT [net] terraform:     }
05:32:21.724 STDOUT [net] terraform:   # aws_vpc.main will be created
05:32:21.725 STDOUT [net] terraform:   + resource "aws_vpc" "main" {
05:32:21.725 STDOUT [net] terraform:       + arn                                  = (known after apply)
05:32:21.725 STDOUT [net] terraform:       + cidr_block                           = "10.1.0.0/16"
05:32:21.725 STDOUT [net] terraform:       + default_network_acl_id               = (known after apply)
05:32:21.725 STDOUT [net] terraform:       + default_route_table_id               = (known after apply)
05:32:21.725 STDOUT [net] terraform:       + default_security_group_id            = (known after apply)
05:32:21.725 STDOUT [net] terraform:       + dhcp_options_id                      = (known after apply)
05:32:21.725 STDOUT [net] terraform:       + enable_dns_hostnames                 = true
05:32:21.725 STDOUT [net] terraform:       + enable_dns_support                   = true
05:32:21.725 STDOUT [net] terraform:       + enable_network_address_usage_metrics = (known after apply)
05:32:21.725 STDOUT [net] terraform:       + id                                   = (known after apply)
05:32:21.725 STDOUT [net] terraform:       + instance_tenancy                     = "default"
05:32:21.726 STDOUT [net] terraform:       + ipv6_association_id                  = (known after apply)
05:32:21.726 STDOUT [net] terraform:       + ipv6_cidr_block                      = (known after apply)
05:32:21.726 STDOUT [net] terraform:       + ipv6_cidr_block_network_border_group = (known after apply)
05:32:21.726 STDOUT [net] terraform:       + main_route_table_id                  = (known after apply)
05:32:21.726 STDOUT [net] terraform:       + owner_id                             = (known after apply)
05:32:21.726 STDOUT [net] terraform:       + tags                                 = {
05:32:21.726 STDOUT [net] terraform:           + "Name" = "my-vpc"
05:32:21.726 STDOUT [net] terraform:         }
05:32:21.726 STDOUT [net] terraform:       + tags_all                             = {
05:32:21.726 STDOUT [net] terraform:           + "Name" = "my-vpc"
05:32:21.727 STDOUT [net] terraform:         }
05:32:21.727 STDOUT [net] terraform:     }
05:32:21.727 STDOUT [net] terraform: Plan: 10 to add, 0 to change, 0 to destroy.
05:32:21.727 STDOUT [net] terraform:
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -p prod
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](http://ip-172-31-20-182.ec2.internal:4141/lock?id=naveenkerati%252Fatlantis-tf-playground%252Fenvironments%252Fprod%252Fdefault)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -p prod
  ```
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```